[
  {
    "rating": 4,
    "text": "It met my expectations"
  },
  {
    "rating": 1,
    "text": "Don't waste your time!  The food was terrible and the service was absolutely slow!"
  },
  {
    "rating": 4,
    "text": "Okay, first of all, my biggest complaint after eating here is that the manager and/or owner was rude. My mother broke something and was very apologetic, but he was having attitude about it. He said these are very hard to find and theyre very expensive, thanks ummmm what?! My biggest food complaint was the bread. What was that?! It was dry and not even good. Like put out a roll or a baguette or a mixed bread basket or something.  The minestrone soup was good, but I wouldnt say fantastic. The reason why I gave this place a 4 star was because the service was good and the entree was actually very good. We had the spinach ravioli (I loved the tomato cream sauce)!"
  },
  {
    "rating": 2,
    "text": "Horrible service , server forgot to place our order and never apologized.  Totally racial profiling if you got tattoos do not go there . Poor service and no privacy , its elbow to elbow"
  },
  {
    "rating": 5,
    "text": "Came by for lunch the other day and it was a tasty experience. Got super lucky and managed to snag a spot on the street right in front of the restaurant!"
  },
  {
    "rating": 4,
    "text": "Boyfriend and I have been here twice, so obviously we like it enough, but for some reason, my main entrees were never spectacular."
  },
  {
    "rating": 5,
    "text": "The atmosphere is cozy  and inviting it's a small space but didn't feel too crowded. The staff are very friendly and happy to answer any and all questions. We ordered the shrimp dumplings which were absolutely heavenly. For our mains I got the NY strip and she got a halibut special that came with a white truffle sauce and mashed potatoes. Her dish was delicious but the fish was overcooked. Mine was incredibly flavorful but the steak had much more fat on it than I'm accustomed to (this may just be a personal preference thing so I'm not docking that) overall I'd go back to try a couple other dishes!"
  },
  {
    "rating": 5,
    "text": "Fourth time back and still amazing. The scallops are by far the best I've ever had still. The sea bass was amazing and the steak was good. As usual, always glad to have reservations even on a rainy Tuesday night."
  },
  {
    "rating": 4,
    "text": "I came here with my mother during dinner time to celebrate my birthday. Unfortunately we've both eaten at too many similar places that I couldn't find anything that stood out."
  },
  {
    "rating": 5,
    "text": "One of THE BEST meals that I have had. Everything was cooked to PERFECTION. Flavors were so, so sumptuous. Can't stop raving about this place. Only wish I found it earlier before I moved"
  },
  {
    "rating": 5,
    "text": "Holy cow! First, I'd recommend getting a reservation. We had to wait 40 minutes. It wasn't bad, we went next door and grabbed a couple of strong drinks from a cash only bar. They texted us when our table was ready. This place is packed and rightfully so. Our server was awesome and helpful. We ordered a couple of the specials that were so over the top. I would definitely recommend this place. Everything was so flavorful. We will definitely be back."
  },
  {
    "rating": 5,
    "text": "I took Gayle here last Saturday for her Birthday.  We had 6:30 reservations and were seated immediately.  This compact restaurant really knows how to pack them in, yet give us our space and comfortable seating at the same time.  And once a particularly loud table across the room finished up, we were able to have a nice conversation."
  },
  {
    "rating": 4,
    "text": "Came here a while back with the family after I had heard about this place and seen it on yelp. This place is extremely tiny though so it's essential that you reserve before you go in. Once we got to our reservation we were promptly seated and I was able to try everything"
  }
]
